{
    "ChrisTitusApp.ps1": "Chris Titus Tech's Windows Utility - Install Programs, Tweaks, Fixes, and Updates. Dev: https://github.com/ChrisTitusTech/winutil",
    "Clear Icon Cache.json": "Clears the Windows icon cache to fix display issues or refresh icons.",
    "Create Restore Point.ps1": "Creates a system restore point to safeguard your current system state.",
    "File Extensions Visibility.json": "Toggles the visibility of file extensions in Windows Explorer.",
    "Remove default apps.ps1": "Uninstalls default Windows applications to declutter your system.",
    "Remove Windows AI.ps1": "Removes Windows AI features, such as Copilot, to optimize performance. Dev: https://raw.githubusercontent.com/zoicware/RemoveWindowsAI/main/RemoveAi.ps1 ",
    "Restart Explorer.ps1": "Restarts the Windows Explorer process to refresh the desktop and taskbar.",
    "Restore all built-in apps.ps1": "Reinstalls all default Windows apps that have been removed.",
    "Snap Assist Flyout.json": "Enables or disables the Snap Assist flyout feature for window management.",
    "Uninstall OneDrive.ps1": "Completely uninstalls OneDrive from your system.",
    "Use light theme.json": "Switches the Windows interface to the light theme.",
    "User Account Control.json": "Adjusts User Account Control (UAC) settings for security and convenience.",
    "Windows Rollback Timer.json": "This plugin adjusts the time window available to revert to a previous version of Windows after an upgrade.",
    "Windows Old Remover.json": "This plugin will remove the ability to roll back a PC to a previous installation of Windows.",
    "Force Windows Update to Windows 11 24H2.json": "Forces Windows Update to initiate the upgrade to Windows 11 version 24H2.",
    "Inplace Upgrade to 24H2 via Registry.json": "Sets registry keys to enable an in-place upgrade to Windows 11 version 24H2.",
    "Windows 11 24H2 Upgrade (Bypass HW Checks).ps1": "Upgrades to Windows 11 version 24H2 while bypassing hardware compatibility checks. This method leverages the Windows Server variant of the Windows setup, which skips most hardware compatibility checks. It allows Windows 11 to be installed on unsupported PCs, bypassing the usual system requirements. Importantly, while the setup runs in server mode, it installs the standard Windows 11 (not the server version)."
}
